window.onload = function () {
    const d = [
        {
            "名字": "警惕幼女打莉沫酱牌牌",
            "图": "./o/警惕幼女打莉沫酱牌牌.webp",
            "字": [
                "一套印刷着莉沫酱的牌。",
                "古时候德意志的学者喜欢打牌，后来他们的爱好被幼女继承了。"
            ]
        },
        {
            "名字": "莉沫酱毯子",
            "图": "./o/莉沫酱毯子.webp",
            "字": [
                "可以穿在身上的毯子。",
                "是黑暗时代的支配者喜欢的衣物。"
            ]
        },
        {
            "名字": "萝莉魅魔的牌子",
            "图": "./o/萝莉魅魔的牌子.webp",
            "字": [
                "魔界随处可见的金牌。",
                "据说黄金时代的萝莉魅魔使用先进的机械化装备工作，提高了生产力。"
            ]
        },
        {
            "名字": "幼女假面",
            "图": "./o/幼女假面.webp",
            "字": [
                "一个覆盖眼部的面具。",
                "据说蕴含着古代幼女的力量，戴上之后可以冒充幼女。"
            ]
        },
        {
            "名字": "莉沫酱灵牌",
            "图": "./o/莉沫酱灵牌.webp",
            "字": [
                "东亚人常用来祭祀神明的木牌。",
                "据说东亚人信奉多神教，他们认为兽可以变成人，人也可以变成神。"
            ]
        },
        {
            "名字": "莉沫酱像",
            "图": "./o/莉沫酱像.webp",
            "字": [
                "一幅精美的画像。",
                "在反圣像运动中，这幅圣像因为太小而幸存了下来。"
            ]
        },
        {
            "名字": "Librian萝莉会",
            "图": "./o/Librian萝莉会.webp",
            "字": [
                "一本看起来是书的笔记本。",
                "因为书根本没有写所以没有内容。"
            ]
        },
        {
            "名字": "警惕幼女打莉沫酱牌牌DLC",
            "图": "./o/警惕幼女打莉沫酱牌牌DLC.webp",
            "字": [
                "另一套印刷着莉沫酱的牌。",
                "DLC是古时候奸邪的商人设下的诅咒，令渴望完整之人不得安宁。"
            ]
        },
        {
            "名字": "幼女丸生成器",
            "图": "./o/幼女丸生成器.webp",
            "字": [
                "使用古代技术制作出的一种道具。",
                "只要按下便会出现一种被称为「幼女丸」的印记。",
                "有些东亚人认为这种印记是好运的象征。"
            ]
        },
        {
            "名字": "大肉棒",
            "图": "./o/大肉棒.webp",
            "字": [
                "普通的肉棒。",
                "虽然和莉沫酱没什么关系，但是群里似乎真的发过大肉棒。"
            ]
        }
    ]
    var app = new Vue({
        el: '#main',
        data: {
            d: d,
            位置: 2,
        }
    })
}
